# Задача 10. Напишете програма, която да изчислява възрастта на дадено куче в кучешки
#години. Забележка: За първите две години, една кучешка година е равна на 10.5 човешки.
#След това всяка следваща кучешка година се равнява на 4-ри човешки години.


age = int(input('Insert years: '))
if age <= 2:
    dog_age = int(age * 10.5)
    print('Dog is ', dog_age, 'years old')
    
else:
    dog_age = int(age - 2) * 4 + 21
    print('Dog age ', dog_age)

    
