# Задача 6. Дадени са няколко цели числа. Напишете програма, която намира онези
#подмножества от тях, които имат сума 0. Примери:
#- Ако са дадени числата {-2, -1, 1}, сумата на -1 и 1 е 0.
#- Ако са дадени числата {3, 1, -7}, няма подмножества със сума 0.

a,b,c = 2, 3, -2,
if a + b == 0:
    print('a, b')
elif a + c == 0:
    print('a, c')
elif b + c == 0:
    print('b, c')
else:
    print('None')
