#Задача 7. Напишете програма, която прилага бонус точки към дадени точки в интервала [1..9]
#чрез прилагане на следните правила:
#- Ако точките са между 1 и 3, програмата ги умножава по 10.
#- Ако точките са между 4 и 6, ги умножава по 100.
#- Ако точките са между 7 и 9, ги умножава по 1000.
#- Ако точките са 0 или повече от 9, се отпечатва съобщение за грешка.

evaluation = int(input('Write number between 0 and 9: '))

if 1 <= evaluation <= 3:
    print(evaluation * 10)
elif 4 <= evaluation <= 6:
    print(evaluation * 100)
elif 7 <= evaluation < 9:
    print(evaluation * 1000)
else:
    print('error')