num = int(input('Insert number between 0 and 999: ')) # Защо дава грешка за отрицателни стойности, а ако се 
# въведе директно число, както е по-долу, работи
#num = 1000

ONES = ["", "едно", "две", "три", "четири", "пет", "шест", "седем", "осем", "девет"]  
TEENS = ["десет", "единадесет", "дванадесет", "тринадесет", "четиринадесет", "петнадесет", "шестнадесет", \
         "седемнадесет", "осемнадесет", "деветнадесет"]  
TENS = ["", "", "двадесет", "тридесет", "четиридесет", "петдесет", "шестдесет", "седемдесет", "осемдесет", "деветдесет"]
HUNDREDS = ["", "сто", "двеста", "триста"]
def convert_to_words(num):  
    if num == 0:  
        return "нула"  
    elif num < 0:
        return "минус " + convert_to_words(abs(num))  
    elif num < 10:  
        return ONES[num]  
    elif num < 20:
        # get from list the number 
        return TEENS[num - 10] 
    elif num < 100:  
        return TENS[num // 10] + (" и " + convert_to_words(num % 10) if num % 10 != 0 else "")  
    elif 100 <= num < 400: 
        return HUNDREDS[num // 100] + (" " + "и" + " " + convert_to_words(num % 100) if num % 100 != 0 else "")
    elif 400 <= num <= 999:  
        return ONES[num // 100] + "стотин" + (" " + " и " + convert_to_words(num % 100) if num % 100 != 0 else "")     
  
    else:  
        return "номерът е извън обхвата"  


words = convert_to_words(num)  
print(words)  

"""Дефинираме четири списъка с думи: ONES съдържа думите за числата 0-9, TEENS съдържа думите за числата 10-19
и TENS съдържа думите за кратни на 10 (с изключение на 10)и HUNDREDS съдържа думите за числата 100 до 300.
     Ние дефинираме функцията convert_to_words, която приема число num като вход и рекурсивно 
     обработва различните величини на числото, използвайки поредица от оператори if.
     Функцията първо проверява дали числото е нула или отрицателно и връща съответната дума(и), ако е така.
     След това функцията проверява дали числото е по-малко от 10 и връща думата за тази цифра.
     Ако числото е между 10 и 19, функцията връща думата за това число с помощта на TEENS
     Ако числото е между 20 и 99, функцията преобразува рекурсивно цифрата на десетиците с 
     помощта на списъка TENS и след това рекурсивно преобразува цифрата на единиците, ако е необходимо.
     Ако числото е между 100 и 999, функцията преобразува рекурсивно цифрата на стотните с 
     помощта на списъка ONES и след това рекурсивно преобразува останалата част от числото, ако е необходимо.
     Функцията връща последния низ от думи."""
